## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| update | `aws_sqs_queue.eks_notification_canada_cadelivery_receipts` |
|        | `aws_sqs_queue.notify_internal_tasks_queue`                 |
|        | `aws_sqs_queue.ses_receipt_callback_buffer`                 |
|        | `aws_sqs_queue_policy.allow_sns_publish`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:33:31.849 STDOUT terraform:   ~ update in-place
13:33:31.849 STDOUT terraform:  <= read (data resources)
13:33:31.849 STDOUT terraform: Terraform will perform the following actions:
13:33:31.849 STDOUT terraform:   # data.aws_iam_policy_document.sns_to_sqs will be read during apply
13:33:31.849 STDOUT terraform:   # (depends on a resource or a module with changes pending)
13:33:31.849 STDOUT terraform:  <= data "aws_iam_policy_document" "sns_to_sqs" {
13:33:31.849 STDOUT terraform:       + id            = (known after apply)
13:33:31.849 STDOUT terraform:       + json          = (known after apply)
13:33:31.849 STDOUT terraform:       + minified_json = (known after apply)
13:33:31.849 STDOUT terraform:       + statement {
13:33:31.849 STDOUT terraform:           + actions   = [
13:33:31.849 STDOUT terraform:               + "sqs:SendMessage",
13:33:31.849 STDOUT terraform:             ]
13:33:31.849 STDOUT terraform:           + effect    = "Allow"
13:33:31.849 STDOUT terraform:           + resources = [
13:33:31.849 STDOUT terraform:               + "arn:aws:sqs:ca-central-1:239043911459:ses-receipt-callback-buffer",
13:33:31.849 STDOUT terraform:             ]
13:33:31.849 STDOUT terraform:           + sid       = "AllowSNSPublish"
13:33:31.849 STDOUT terraform:           + condition {
13:33:31.849 STDOUT terraform:               + test     = "ArnLike"
13:33:31.849 STDOUT terraform:               + values   = [
13:33:31.849 STDOUT terraform:                   + "arn:aws:sns:ca-central-1:239043911459:ses-callback",
13:33:31.849 STDOUT terraform:                 ]
13:33:31.849 STDOUT terraform:               + variable = "aws:SourceArn"
13:33:31.849 STDOUT terraform:             }
13:33:31.849 STDOUT terraform:           + principals {
13:33:31.849 STDOUT terraform:               + identifiers = [
13:33:31.849 STDOUT terraform:                   + "*",
13:33:31.850 STDOUT terraform:                 ]
13:33:31.850 STDOUT terraform:               + type        = "AWS"
13:33:31.850 STDOUT terraform:             }
13:33:31.850 STDOUT terraform:         }
13:33:31.850 STDOUT terraform:     }
13:33:31.850 STDOUT terraform:   # aws_sqs_queue.eks_notification_canada_cadelivery_receipts will be updated in-place
13:33:31.850 STDOUT terraform:   ~ resource "aws_sqs_queue" "eks_notification_canada_cadelivery_receipts" {
13:33:31.850 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/239043911459/eks-notification-canada-cadelivery-receipts"
13:33:31.850 STDOUT terraform:       ~ max_message_size                  = 262144 -> 1048576
13:33:31.850 STDOUT terraform:         name                              = "eks-notification-canada-cadelivery-receipts"
13:33:31.850 STDOUT terraform:         tags                              = {
13:33:31.850 STDOUT terraform:             "Environment" = "staging"
13:33:31.850 STDOUT terraform:         }
13:33:31.850 STDOUT terraform:         # (19 unchanged attributes hidden)
13:33:31.850 STDOUT terraform:     }
13:33:31.850 STDOUT terraform:   # aws_sqs_queue.notify_internal_tasks_queue will be updated in-place
13:33:31.850 STDOUT terraform:   ~ resource "aws_sqs_queue" "notify_internal_tasks_queue" {
13:33:31.850 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/239043911459/eks-notification-canada-canotify-internal-tasks"
13:33:31.850 STDOUT terraform:       ~ max_message_size                  = 262144 -> 1048576
13:33:31.850 STDOUT terraform:         name                              = "eks-notification-canada-canotify-internal-tasks"
13:33:31.851 STDOUT terraform:         tags                              = {}
13:33:31.851 STDOUT terraform:         # (19 unchanged attributes hidden)
13:33:31.851 STDOUT terraform:     }
13:33:31.851 STDOUT terraform:   # aws_sqs_queue.ses_receipt_callback_buffer will be updated in-place
13:33:31.851 STDOUT terraform:   ~ resource "aws_sqs_queue" "ses_receipt_callback_buffer" {
13:33:31.851 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/239043911459/ses-receipt-callback-buffer"
13:33:31.851 STDOUT terraform:       ~ max_message_size                  = 262144 -> 1048576
13:33:31.851 STDOUT terraform:         name                              = "ses-receipt-callback-buffer"
13:33:31.851 STDOUT terraform:         tags                              = {
13:33:31.851 STDOUT terraform:             "Environment" = "staging"
13:33:31.851 STDOUT terraform:         }
13:33:31.851 STDOUT terraform:         # (19 unchanged attributes hidden)
13:33:31.851 STDOUT terraform:     }
13:33:31.851 STDOUT terraform:   # aws_sqs_queue_policy.allow_sns_publish will be updated in-place
13:33:31.851 STDOUT terraform:   ~ resource "aws_sqs_queue_policy" "allow_sns_publish" {
13:33:31.851 STDOUT terraform:         id        = "https://sqs.ca-central-1.amazonaws.com/239043911459/ses-receipt-callback-buffer"
13:33:31.851 STDOUT terraform:       ~ policy    = jsonencode(
13:33:31.851 STDOUT terraform:             {
13:33:31.851 STDOUT terraform:               - Statement = [
13:33:31.851 STDOUT terraform:                   - {
13:33:31.851 STDOUT terraform:                       - Action    = "sqs:SendMessage"
13:33:31.851 STDOUT terraform:                       - Condition = {
13:33:31.851 STDOUT terraform:                           - ArnLike = {
13:33:31.851 STDOUT terraform:                               - "aws:SourceArn" = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
13:33:31.851 STDOUT terraform:                             }
13:33:31.852 STDOUT terraform:                         }
13:33:31.852 STDOUT terraform:                       - Effect    = "Allow"
13:33:31.852 STDOUT terraform:                       - Principal = {
13:33:31.852 STDOUT terraform:                           - AWS = "*"
13:33:31.852 STDOUT terraform:                         }
13:33:31.852 STDOUT terraform:                       - Resource  = "arn:aws:sqs:ca-central-1:239043911459:ses-receipt-callback-buffer"
13:33:31.852 STDOUT terraform:                       - Sid       = "AllowSNSPublish"
13:33:31.852 STDOUT terraform:                     },
13:33:31.852 STDOUT terraform:                 ]
13:33:31.852 STDOUT terraform:               - Version   = "2012-10-17"
13:33:31.852 STDOUT terraform:             }
13:33:31.852 STDOUT terraform:         ) -> (known after apply)
13:33:31.852 STDOUT terraform:         # (2 unchanged attributes hidden)
13:33:31.852 STDOUT terraform:     }
13:33:31.852 STDOUT terraform: Plan: 0 to add, 4 to change, 0 to destroy.
13:33:31.854 STDOUT terraform: Warning: Argument is deprecated
13:33:31.854 STDOUT terraform:   with aws_s3_bucket.csv_bucket,
13:33:31.854 STDOUT terraform:   on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
13:33:31.854 STDOUT terraform:    5: resource "aws_s3_bucket" "csv_bucket" {
13:33:31.854 STDOUT terraform: lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
13:33:31.854 STDOUT terraform: resource instead.
13:33:31.854 STDOUT terraform: (and 61 more similar warnings elsewhere)
13:33:31.855 STDOUT terraform: Warning: Deprecated attribute
13:33:31.855 STDOUT terraform:   on .terraform/modules/notify_slack_critical.lambda/outputs.tf line 9, in output "lambda_function_arn_static":
13:33:31.855 STDOUT terraform:    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:aws:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
13:33:31.856 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
13:33:31.856 STDOUT terraform: details.
13:33:31.856 STDOUT terraform: (and 17 more similar warnings elsewhere)
13:33:31.856 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:33:31.856 STDOUT terraform: Saved the plan to: plan.tfplan
13:33:31.856 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:33:31.856 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.route53_servfail_notification[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
